; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	infrared3 - mode
	spectrograph9 - mode
	infrared7 - mode
	infrared8 - mode
	infrared0 - mode
	thermograph2 - mode
	spectrograph6 - mode
	image4 - mode
	spectrograph5 - mode
	image1 - mode
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared7)
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 infrared7)
	(supports instrument2 infrared0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph6)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument5 image1)
	(supports instrument5 spectrograph6)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared3)
	(supports instrument6 infrared0)
	(supports instrument6 infrared7)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared8)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared7)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument8 spectrograph9)
	(supports instrument8 spectrograph5)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Planet6 image1)
	(have_image Star7 infrared0)
	(have_image Star7 spectrograph5)
	(have_image Star7 spectrograph9)
	(have_image Phenomenon8 infrared8)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon8 infrared7)
	(have_image Planet9 thermograph2)
	(have_image Planet9 infrared7)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon10 spectrograph6)
	(have_image Phenomenon10 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation1 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 13
2. (turn_to satellite2 groundstation1 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 13
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 13
4. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 13
5. (turn_to satellite2 planet9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet9)
   goals met: 0 of 13
6. (take_image satellite2 planet9 instrument7 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 1 of 13
7. (take_image satellite2 planet9 instrument7 infrared7)
   added: (have_image planet9 infrared7)
   goals met: 2 of 13
8. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 13
9. (turn_to satellite1 groundstation1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 13
10. (turn_to satellite0 groundstation0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 13
11. (take_image satellite2 phenomenon8 instrument7 infrared8)
   added: (have_image phenomenon8 infrared8)
   goals met: 4 of 13
12. (take_image satellite2 phenomenon8 instrument7 infrared7)
   added: (have_image phenomenon8 infrared7)
   goals met: 5 of 13
13. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 5 of 13
14. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 5 of 13
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 13
16. (calibrate satellite3 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 5 of 13
17. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 5 of 13
18. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 5 of 13
19. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 13
20. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 13
21. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 13
22. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 13
23. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 6 of 13
24. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 7 of 13
25. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   goals met: 8 of 13
26. (turn_to satellite1 phenomenon10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon10)
   goals met: 8 of 13
27. (take_image satellite1 phenomenon10 instrument4 spectrograph6)
   added: (have_image phenomenon10 spectrograph6)
   goals met: 9 of 13
28. (turn_to satellite1 star7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star7)
   goals met: 9 of 13
29. (take_image satellite1 star7 instrument4 infrared0)
   added: (have_image star7 infrared0)
   goals met: 10 of 13
30. (turn_to satellite2 phenomenon10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon10)
   goals met: 10 of 13
31. (take_image satellite2 phenomenon10 instrument7 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 11 of 13
32. (turn_to satellite3 star7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star7)
   goals met: 11 of 13
33. (take_image satellite3 star7 instrument8 spectrograph5)
   added: (have_image star7 spectrograph5)
   goals met: 12 of 13
34. (take_image satellite3 star7 instrument8 spectrograph9)
   added: (have_image star7 spectrograph9)
   goals met: 13 of 13
